ThirdParty-v1912/swak4Foam-latest/Examples/FromPresentations/OFW8_landspeedersInCanyon/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5 -5 0)
    (15 -5 0)
    (15  5 0)
    (-5  5 0)
    (-5 -5 8)
    (15 -5 8)
    (15  5 8)
    (-5  5 8)
    (50 -5 0)
    (50  5 0)
    (50 -5 8)
    (50  5 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 8) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (20 10 8) simpleGrading (2.78 1 1)
);

edges
(
);

boundary
(
    canyonWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (8 10 5 1)
            (2 9 11 6)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 11 10 8)
        );
    }
    canyonFloor
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (1 2 9 8)
        );
    }
    sky
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
        );
    }
);

// ************************************************************************* //
