ThirdParty-v1912/swak4Foam-latest/Examples/FromPresentations/OFW8_landspeedersInCanyon/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    "canyon.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    "landSpeeder.+_main_.+"
    {
        type            fixedValue;
        value uniform (0 0 0);
    }

    "landSpeeder.+Jet_(hull|mount)"
    {
        type            fixedValue;
        value uniform (0 0 0);
    }

    "landSpeeder.+Jet_inlet"
    {
        type groovyBC;
        value uniform (0 0 0);
        variables (
            "vIn{inlet}=sum(area()*U)/sum(area());"
        );
        valueExpression "0.75*vIn";
    }

    "landSpeeder.+Jet_outlet"
    {
        type groovyBC;
        value uniform (0 0 0);
        variables (
            "vIn{inlet}=sum(area()*U)/sum(area());"
        );
        valueExpression "1.25*vIn";
    }

    sky
    {
        type slip;
    }
}


// ************************************************************************* //
