ThirdParty-v1912/swak4Foam-latest/Examples/FromPresentations/OFW8_landspeedersInCanyon/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffsLuke
{
    type        forceCoeffs;
    functionObjectLibs ( "libforces.so" );
    outputControl outputTime;
    log         yes;

    patches     ( "landSpeederLuke.*" );
    pName       p;
    UName       U;
    rhoName     rhoInf;      // Indicates incompressible
    log         true;
    rhoInf      1;           // Redundant for incompressible
    liftDir     (0 0 1);
    dragDir     (1 0 0);
    CofR        (0.72 0 0);  // Axle midpoint on ground
    pitchAxis   (0 1 0);
    magUInf     80;
    lRef        1.42;        // Wheelbase length
    Aref        0.75;        // Estimated

    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        format      gnuplot;
        cumulative  yes;
    }
}

forceCoeffsBiggs {
    $forceCoeffsLuke;
    patches     ( "landSpeederBiggs.*" );
}

// ************************************************************************* //
